nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/wifi_examples/wifi_test_mode/wifi_bt_config.c
/*
 * Copyright 2021-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "wifi_bt_config.h"
#include "pin_mux.h"
#include "fsl_gpio.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

void BOARD_WIFI_BT_Enable(bool enable)
{
    if (enable)
    {
        /* Enable module */
#ifdef WIFI_BT_USE_M2_INTERFACE
        /* Enable power supply for M.2 */
        GPIO_PortSet(BOARD_INITPINSM2_SD_RST_N_GPIO, BOARD_INITPINSM2_SD_RST_N_PORT,
                     BOARD_INITPINSM2_SD_RST_N_PIN_MASK);
        vTaskDelay(pdMS_TO_TICKS(100));

        /* Set WL_REG_ON to 1 */
        GPIO_PortSet(BOARD_INITPINSM2_WL_REG_ON_GPIO, BOARD_INITPINSM2_WL_REG_ON_PORT,
                     BOARD_INITPINSM2_WL_REG_ON_PIN_MASK);
        vTaskDelay(pdMS_TO_TICKS(100));
#elif defined(WIFI_BT_USE_USD_INTERFACE)
        /* Enable power supply for SD */
        GPIO_PortSet(BOARD_SDMMC_SD_POWER_RESET_GPIO_BASE, BOARD_SDMMC_SD_POWER_RESET_GPIO_PORT,
                     1U << BOARD_SDMMC_SD_POWER_RESET_GPIO_PIN);
        vTaskDelay(pdMS_TO_TICKS(100));
#endif /* WIFI_BT_USE_M2_INTERFACE */
    }
    else
    {
        /* Disable module */
#ifdef WIFI_BT_USE_M2_INTERFACE
        /* Set WL_REG_ON to 0 */
        GPIO_PortClear(BOARD_INITPINSM2_WL_REG_ON_GPIO, BOARD_INITPINSM2_WL_REG_ON_PORT,
                       BOARD_INITPINSM2_WL_REG_ON_PIN_MASK);

        /* Disable power supply for M.2 */
        GPIO_PortClear(BOARD_INITPINSM2_SD_RST_N_GPIO, BOARD_INITPINSM2_SD_RST_N_PORT,
                       BOARD_INITPINSM2_SD_RST_N_PIN_MASK);
#elif defined(WIFI_BT_USE_USD_INTERFACE)
        /* Disable power supply for SD */
        GPIO_PortClear(BOARD_SDMMC_SD_POWER_RESET_GPIO_BASE, BOARD_SDMMC_SD_POWER_RESET_GPIO_PORT,
                       1U << BOARD_SDMMC_SD_POWER_RESET_GPIO_PIN);
#endif /* WIFI_BT_USE_M2_INTERFACE */
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

void BOARD_WIFI_BT_Config(void *card, sdio_int_t cardInt)
{
    BOARD_SDIO_Config(card, NULL, BOARD_SDMMC_SDIO_HOST_IRQ_PRIORITY, cardInt);
#ifdef WIFI_BT_USE_M2_INTERFACE
    BOARD_InitPinsM2();
#endif
    BOARD_WIFI_BT_Enable(false);
}
